<head>
<style type="text/css">
body{
line-height:1.6;
font-size:18px;
color:#444;
padding:0
10px}
h1,h2,h3{
line-height:1.2
}
</style>
</head>
<h1>Especificaci&#xF3;n de Red para Half-World (HWNET)</h1>
<h4>SPDX identifier: COIL-1.0</h4> 
<h4>Se recomienda utilizar la extensi&#xF3;n &#x201C;.hwnet&#x201D; para documentos HWNET (donde sea relevante).</h4>
<h4>HWNET se puede identificar con el tipo MIME <code>text/hwnet</code></h4>
<h4>Por favor, leer las especificaciones HWPACK y HWDOC antes de esta.</h4>
<p>Los HWDOCs aqu&#xED; representados son solo para incrementar la claridad. Todo debe ser mandado por red en un HWPACK minificado, obtenido de la conversi&#xF3;n m&#xE1;s compacta posible de HWDOC.</p>
<h4>HWNET est&#xE1; dise&#xF1;ada para funcionar con una capa de transporte capaz de transportar 400 bytes, con <em>cualquier</em> cantidad de p&#xE9;rdida de paquetes/inestabilidad. Debido a esto, no realiza verificaci&#xF3;n de identidad del jugador, pero se puede extender f&#xE1;cilmente para hacer esto.<em>Deber&#xED;a</em> ser imposible mandar un paquete que se adhiera a la especificaci&#xF3;n que tenga una longitud de m&#xE1;s de 400 caracteres ASCII.</h4>
<h3>Cuando se solicita informati&#xF3;n del Nodo Servidor, el siguiente formato deber&#xED;a seguirse:</h3>
<h3>FORMATO NODO CLIENTE</h3>
<pre><code>[user]
id=[&quot;(identification)&quot; ...]

[data]
    exten=[&quot;(ext)&quot;]
    [data.(identification)]
        thrusters=[&quot;(thru1)&quot;, &quot;(thru2)&quot;, &quot;(steer)&quot;]

[query]
    mode=[&quot;(mode)&quot;]</code></pre>
<p>Donde (identification) es el n&#xFA;mero(s) de jugador deseados para controlar, sin embargo no se deben solicitar m&#xE1;s de cuatro distintos.. Donde (ext) es la especificaci&#xF3;n deseada por el Cliente. El Cliente deber&#xED;a estar preparado para cambiar al formato base si no consigue entender las respuestas del Nodo Servidor.</p>
<p>Donde (thru1) es el valor del primer eje de pedal Donde (thru2) es el valor del segundo eje de pedal Donde (steer) es el valor del eje del volante</p>
<p>Donde (mode) es una de las letras espec&#xED;ficadas justo debajo:</p>
<h3>CLIENT NODE MODES</h3>
<p>r - RACE INFORMATION l - LEADERBOARD INFORMATION ***</p>
<h4>El servidor debe responder a la direcci&#xF3;n IP del cliente (o el equivalente m&#xE1;s cercano en caso el protocolo usado no es IP) siguiendo este formato:</h4>
<h3>MASTER NODE FORMT</h3>
<pre><code>[data]
track=[&quot;(trackname)&quot;]
game=[&quot;(gamemode)&quot;]
ext=[&quot;(extension)&quot;]
1=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]
2=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]
3=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]
4=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]
5=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]
6=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]
7=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]
8=[&quot;(pos1)&quot;, &quot;(pos2)&quot;, &quot;t1&quot;, &quot;t2&quot;, &quot;t3&quot;]</code></pre>
<hr />
<p>Donde (trackname) es un set de ocho caracteres alfanum&#xE9;ricos que representan el Circuito usado. Donde (gamemode) es un set de ocho caracteres alfanum&#xE9;ricos que representan el Modo usado. Para indicar una carrera normal, deber&#xED;a ser "_DEFAULT"</p>
<p>Donde (pos1) y (pos2) son una representaci&#xF3;n 2D de ese veh&#xED;culo, y t1-t3 son las flags descritar debajo.</p>
<p>Nota: Estas flags son abstractas y le dan contexto al cliente, sin dar indicaciones computacionalmente espec&#xED;ficas. Si la flag &#x2018;r&#x2019; es recibida, Tipo Carrera 1, 2, y 3 deben ser proporcionados. Si la flag &#x2018;l&#x2019; es recibida, un Tipo Tabla de Puntuaciones adicional (4) debe ser proporcionado, y los otros tres deben ser dejados como strings vac&#xED;as.</p>
<h3>FLAGS DE NODO SERVIDOR</h3>
<h3>SOLICITACI&#xD3;N AL SERVIDOR</h3>
<p>r - CARRERA l - TABLA DE PUNTUACIONES</p>
<h3>Estado de carrera ["" "" ""]</h3>
<ul>
<li><p>TIPO 1 - ESTADOS DEL VEH&#xCD;CULO - o - FUERA DE CARRETERA u - DERRAPE x - HERIDO s - LENTO z - R&#xC1;PIDO e - ELECTRIFICADO c - CHOQUE y - NADA</p></li>
<li><p>TIPO 2 - ESTADOS DEL MOVIMIENTO - f - HACIA DELANTE b - HACIA ATR&#xC1;S k - ARRANQUE i - PARADO</p></li>
<li><p>TIPO 3 - ESTADOS DE LA CONEXI&#xD3;N - a - CONECTADO m - CONEXI&#xD3;N M&#xDA;LTIPLE t - DESCONEXI&#xD3;N h - PAUSA *** ### ESTADOS DE LA TABLA DE PUNTUACIONES TIPO 4</p></li>
</ul>
<p>(1..8) - POSICI&#xD3;N ***</p>
<p>EJEMPLO DE PAQUETE DEL CLIENTE</p>
<p><code>{"user":{"id":["1","2","3","4"]},"data":{"1":{"thrusters":["123567","1234567","1234567"]},"2":{"thrusters":["123567","1234567","1234567"]},"3":{"thrusters":["123567","1234567","1234567"]},"4":{"thrusters":["123567","1234567","1234567"]},"exten":["HalfWrld"]},"query":{"mode":["r"]}}</code></p>
<p>EJEMPLO DE PAQUETE DEL SERVIDOR</p>
<p><code>{"data":{"1":["1234567","1234567","a","b","c"],"2":["1234567","1234567","a","b","c"],"3":["1234567","1234567","a","b","c"],"4":["1234567","1234567","a","b","c"],"5":["1234567","1234567","a","b","c"],"6":["1234567","1234567","a","b","c"],"7":["1234567","1234567","a","b","c"],"8":["1234567","1234567","a","b","c"],"track":["TRACKADD"],"game":["RACERACE"],"ext":["HelloIts"]}}</code></p>
